export const KOREAN_ALPHABET = {
    vowels: [
        ["ㅏ", "a"],
        ["ㅑ", "ya"],
        ["ㅓ", "eo"],
        ["ㅕ", "yeo"],
        ["ㅗ", "o"],
        ["ㅛ", "yo"],
        ["ㅜ", "u"],
        ["ㅠ", "yu"],
        ["ㅡ", "eu"],
        ["ㅣ", "i"],
    ],

    consonants: [
        ["ㄱ", "g/k"],
        ["ㄴ", "n"],
        ["ㄷ", "d/t"],
        ["ㄹ", "r/l"],
        ["ㅁ", "m"],
        ["ㅂ", "b/p"],
        ["ㅅ", "s"],
        ["ㅇ", "ng"],
        ["ㅈ", "j"],
        ["ㅊ", "ch"],
        ["ㅋ", "k"],
        ["ㅌ", "t"],
        ["ㅍ", "p"],
        ["ㅎ", "h"],
    ],

    doubleConsonants: [
        ["ㄲ", "kk"],
        ["ㄸ", "tt"],
        ["ㅃ", "pp"],
        ["ㅆ", "ss"],
        ["ㅉ", "jj"],
    ],

    compoundVowels: [
        ["ㅘ", "wa"],
        ["ㅙ", "wae"],
        ["ㅚ", "oe"],
        ["ㅝ", "wo"],
        ["ㅞ", "we"],
        ["ㅟ", "wi"],
        ["ㅢ", "ui"],
    ],
};